from ultralytics import YOLO

# ⚠️ บรรทัดนี้สำคัญที่สุดสำหรับ Windows ครับ!
if __name__ == '__main__':
    
    # 1. โหลดโมเดล (เลือกใช้ v8 หรือ v11 ตามชอบ)
    model = YOLO('yolov8n.pt') 

    # 2. เริ่มเทรน (สังเกตว่าต้องย่อหน้าเข้ามาอยู่ใต้ if)
    results = model.train(
        data=r'D:/my_work/canteen/dataset/data.yaml', 
        epochs=100, 
        imgsz=640, 
        device=0,
        batch=16,
        name='human_final', # เปลี่ยนชื่อกันงง
        workers=4           # (แนะนำ) ลดจำนวน worker ลงหน่อยเพื่อความเสถียรบน Windows
    )

    print("Training Completed! 🎉")